Revit 2024 API
UIMacroManager Properties
The UIMacroManager type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroManager
 The DB macro manager.
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace